<?php

namespace Database\Seeders;

use App\Models\Dua;
use App\Models\DuaCategory;
use Illuminate\Database\Seeder;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;

class DuaSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        $duaCategories = ['دعاء لبس الثوب', 'دعاء لبس الثوب الجديد', 'ما يقول إذا وضع الثوب',
            'دعاء دخول الخلاء - الحمام', 'دعاء الخروج من الخلاء - الحمام', 'الذكر قبل الوضوء',
            'الذكر بعد الفراغ من الوضوء', 'الذكر عند الخروج من المنزل', 'الذكر عند دخول المنزل',
            'دعاء الذهاب إلى المسجد', 'دعاء دخول المسجد', 'دعاء الخروج من المسجد', 'دعاء الاستفتاح',
            'دعاء الركوع', 'دعاء الرفع من الركوع', 'دعاء السجود',
        ];

        $order = 1;
        foreach ($duaCategories as $category) {
            DuaCategory::firstOrCreate(
                ['name' => $category],
                ['order' => $order++],
            );
        }

        $categories = DuaCategory::pluck('id', 'name');

        $duas = [
            [
                'dua_category_id' => $categories['دعاء لبس الثوب'],
                'dua' => 'الْحَمْدُ للَّهِ الَّذِي كَسَانِي هَذَا الثَّوْبَ وَرَزَقَنِيهِ مِنْ غَيْرِ حَوْلٍ مِنِّي وَلاَ قُوَّة',
            ],
            [
                'dua_category_id' => $categories['دعاء لبس الثوب الجديد'],
                'dua' => 'اللَّهُمَّ لَكَ الْحَمْدُ أَنْتَ كَسَوْتَنِيهِ، أَسْأَلُكَ مِنْ خَيْرِهِ وَخَيْرِ مَا صُنِعَ لَهُ، وَأَعُوذُ بِكَ مِنْ شَرِّهِ وَشَرِّ مَا صُنِعَ لَهُ',
            ],
            [
                'dua_category_id' => $categories['دعاء لبس الثوب الجديد'],
                'dua' => 'تُبْلِي وَيُخْلِفُ اللَّهُ تَعَالَى',
            ],
            [
                'dua_category_id' => $categories['دعاء لبس الثوب الجديد'],
                'dua' => 'اِلْبَسْ جَدِيداً وَعِشْ حَمِيداً وَمُتْ شَهِيداً',
            ],
            [
                'dua_category_id' => $categories['ما يقول إذا وضع الثوب'],
                'dua' => 'بِسْمِ اللَّهِ',
            ],
            [
                'dua_category_id' => $categories['دعاء دخول الخلاء - الحمام'],
                'dua' => '(بِسْمِ اللَّهِ) اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْخُبْثِ وَالْخَبائِث',
            ],
            [
                'dua_category_id' => $categories['دعاء الخروج من الخلاء - الحمام'],
                'dua' => 'غُفْرَانَكَ',
            ],
            [
                'dua_category_id' => $categories['الذكر قبل الوضوء'],
                'dua' => 'بِسْمِ اللَّهِ',
            ],
            [
                'dua_category_id' => $categories['الذكر بعد الفراغ من الوضوء'],
                'dua' => 'أَشْهَدُ أَنْ لاَ إِلَهَ إِلاَّ اللَّهُ وَحْدَهُ لاَ شَرِيكَ لَهُ وَأَشْهَدُ أَنَّ مُحَمَّداً عَبْدُهُ وَرَسُولُهُ',
            ],
            [
                'dua_category_id' => $categories['الذكر بعد الفراغ من الوضوء'],
                'dua' => 'اللَّهُمَّ اجْعَلْنِي مِنَ التَّوَّابِينَ وَاجْعَلْنِي مِنَ الْمُتَطَهِّرِينَ',
            ],
            [
                'dua_category_id' => $categories['الذكر بعد الفراغ من الوضوء'],
                'dua' => 'سُبْحانَكَ اللَّهُمَّ وَبِحَمْدِكَ، أَشْهَدُ أَنْ لاَ إِلَهَ إِلاَّ أَنْتَ، أَسْتَغْفِرُكَ وَأَتوبُ إِلَيْكَ',
            ],
            [
                'dua_category_id' => $categories['الذكر عند الخروج من المنزل'],
                'dua' => 'بِسْمِ اللَّهِ، تَوَكَّلْتُ عَلَى اللَّهِ، وَلَاَ حَوْلَ وَلَا قُوَّةَ إِلاَّ بِاللَّهِ',
            ],
            [
                'dua_category_id' => $categories['الذكر عند الخروج من المنزل'],
                'dua' => 'اللَّهُمَّ إِنِّي أَعُوذُ بِكَ أَنْ أَضِلَّ، أَوْ أُضَلَّ، أَوْ أَزِلَّ، أَوْ أُزَلَّ، أَوْ أَظْلِمَ، أَوْ أُظْلَمَ، أَوْ أَجْهَلَ، أَوْ يُجْهَلَ عَلَيَّ',
            ],
            [
                'dua_category_id' => $categories['الذكر عند دخول المنزل'],
                'dua' => 'بِسْمِ اللَّهِ وَلَجْنَا، وَبِسْمِ اللَّهِ خَرَجْنَا، وَعَلَى اللَّهِ رَبِّنَا تَوَكَّلْنَا، ثُمَّ لِيُسَلِّمْ عَلَى أَهْلِهِ',
            ],
            [
                'dua_category_id' => $categories['دعاء الذهاب إلى المسجد'],
                'dua' => 'اللَّهُمَّ اجْعَلْ فِي قَلْبِي نُوراً، وَفِي لِسَانِي نُوراً، وَفِي سَمْعِي نُوراً، وَفِي بَصَرِي نُوراً، وَمِنْ فَوْقِي نُوراً، وَمِنْ تَحْتِي نُوراً، وَعَنْ يَمِينِي نُوراً، وَعَنْ شِمَالِي نُوراً، وَمِنْ أَمَامِي نُوراً، وَمِنْ خَلْفِي نُوراً، وَاجْعَلْ فِي نَفْسِي نُوراً، وَأَعْظِمْ لِي نُوراً، وَعَظِّم لِي نُوراً، وَاجْعَلْ لِي نُوراً، وَاجْعَلْنِي نُوراً، اللَّهُمَّ أَعْطِنِي نُوراً، وَاجْعَلْ فِي عَصَبِي نُوراً، وَفِي لَحْمِي نُوراً، وَفِي دَمِي نُوراً، وَفِي شَعْرِي نُوراً، وَفِي بَشَرِي نُوراً، اللَّهُمَّ اجْعَلْ لِي نُوراً فِي قَبْرِي وَنُوراً فِي عِظَامِي، وَزِدْنِي نُوراً، وَزِدْنِي نُوراً، وَزِدْنِي نُوراً، وَهَبْ لِي نُوراً عَلَى نُورٍ)]',
            ],
            [
                'dua_category_id' => $categories['دعاء دخول المسجد'],
                'dua' => '(يَبْدَأُ بِرِجْلِهِ الْيُمْنَى) ، وَيَقُولُ: ((أَعُوذُ بِاللَّهِ العَظِيمِ، وَبِوَجْهِهِ الْكَرِيمِ، وَسُلْطَانِهِ الْقَدِيمِ، مِنَ الشَّيْطَانِ الرَّجِيمِ))  [بِسْمِ اللَّهِ، وَالصَّلَاةُ] [وَالسَّلَامُ عَلَى رَسُولِ اللَّهِ]  ((اللَّهُمَّ افْتَحْ لِي أَبْوَابَ رَحْمَتِكَ)).',
            ],
            [
                'dua_category_id' => $categories['دعاء الخروج من المسجد'],
                'dua' => '((يَبْدَأُ بِرِجْلِهِ الْيُسْرَى))  وَيَقُولُ: ((بِسْمِ اللَّهِ وَالصّلَاةُ وَالسَّلَامُ عَلَى رَسُولِ اللَّهِ، اللَّهُمَّ إِنِّي أَسْأَلُكَ مِنْ فَضْلِك، اللَّهُمَّ اعْصِمْنِي مِنَ الشَّيْطَانِ الرَّجِيمِ)).',
            ],
            [
                'dua_category_id' => $categories['دعاء الاستفتاح'],
                'dua' => 'للَّهُمَّ بَاعِدْ بَيْنِي وَبَيْنَ خَطَايَايَ كَمَا بَاعَدْتَ بَيْنَ الْمَشْرِقِ وَالْمَغْرِبِ، اللَّهُمَّ نَقِّنِي مِنْ خَطَايَايَ كَمَا يُنَقَّى الثَّوْبُ الْأَبْيَضُ مِنَ الدَّنَسِ، اللَّهُمَّ اغْسِلْني مِنْ خَطَايَايَ، بِالثَّلْجِ وَالْماءِ وَالْبَرَدِ',
            ],
            [
                'dua_category_id' => $categories['دعاء الاستفتاح'],
                'dua' => 'سُبْحانَكَ اللَّهُمَّ وَبِحَمْدِكَ، وَتَبارَكَ اسْمُكَ، وَتَعَالَى جَدُّكَ، وَلاَ إِلَهَ غَيْرُكَ',
            ],
            [
                'dua_category_id' => $categories['دعاء الاستفتاح'],
                'dua' => 'اللَّهُمَّ رَبَّ جِبْرَائِيلَ، وَمِيْكَائِيلَ، وَإِسْرَافِيلَ، فَاطِرَ السَّمَوَاتِ وَالأَرْضِ، عَالِمَ الغَيْبِ وَالشَّهَادَةِ أَنْتَ تَحْكُمُ بَيْنَ عِبَادِكَ فِيمَا كَانُوا فِيهِ يَخْتَلِفُونَ. اهْدِنِي لِمَا اخْتُلِفَ فِيهِ مِنَ الْحَقِّ بِإِذْنِكَ إِنَّكَ تَهْدِي مَنْ تَشَاءُ إِلَى صِرَاطٍ مُسْتَقيمٍ',
            ],
            [
                'dua_category_id' => $categories['دعاء الركوع'],
                'dua' => 'سُبْحانَ رَبِّيَ الْعَظِيمِ',
                'count' => 3,
            ],
            [
                'dua_category_id' => $categories['دعاء الركوع'],
                'dua' => 'سُبْحَانَكَ اللَّهُمَّ رَبَّنَا وَبِحَمْدِكَ، اللَّهُمَّ اغْفِرْ لِي',
            ],
            [
                'dua_category_id' => $categories['دعاء الركوع'],
                'dua' => 'سُبُّوُحٌ، قُدُّوسٌ، رَبُّ المَلاَئِكَةِ وَالرُّوحِ',
            ],
            [
                'dua_category_id' => $categories['دعاء الرفع من الركوع'],
                'dua' => 'سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ',
            ],
            [
                'dua_category_id' => $categories['دعاء الرفع من الركوع'],
                'dua' => 'بَّنَا وَلَكَ الْحَمْدُ، حَمْداً كَثيراً طَيِّباً مُبارَكاً فِيهِ',
            ],
            [
                'dua_category_id' => $categories['دعاء السجود'],
                'dua' => 'سُبْحَانَ رَبِّيَ الأَعْلَى',
                'count' => 3,
            ],
            [
                'dua_category_id' => $categories['دعاء السجود'],
                'dua' => 'سُبْحَانَكَ اللَّهُمَّ رَبَّنَا وَبِحَمْدِكَ، اللَّهُمَّ اغْفِرْ لِي',
            ],
            [
                'dua_category_id' => $categories['دعاء السجود'],
                'dua' => 'سُبوحٌ، قُدُّوسٌ، رَبُّ الْمَلَائِكَةِ وَالرُّوحِ',
            ],
            [
                'dua_category_id' => $categories['دعاء السجود'],
                'dua' => 'اللَّهُمَّ لَكَ سَجَدْتُ وَبِكَ آمَنْتُ، وَلَكَ أَسْلَمْتُ، سَجَدَ وَجْهِيَ لِلَّذِي خَلَقَهُ، وَصَوَّرَهُ، وَشَقَّ سَمْعَهُ وَبَصَرَهُ، تَبَارَكَ اللَّهُ أَحْسنُ الْخَالِقينَ',
            ],
        ];

        $orderCounter = [];

        foreach ($duas as $item) {

            $catId = $item['dua_category_id'];
            $orderCounter[$catId] = ($orderCounter[$catId] ?? 0) + 1;

            Dua::create([
                'dua_category_id' => $catId,
                'dua' => $item['dua'],
                'reference' => null,
                'order' => $orderCounter[$catId],
                'count' => $item['count'] ?? 1,
            ]);
        }
    }
}
